app/controllers/application_controller.rb

  def main
     @user = User.new
     @all_users = User.all
---
SELECT "users".* FROM "users"