app/controllers/users_controller.rb

    def create
        @user = User.new user_params
        @user[:optional] = params[:user][:optional] if !params[:user][:optional].empty?
        if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dog"], ["password_digest", "$2a$10$/bu4RzqtragZ7tU4o6sn.e1r1UkyTHRjebj.RvNqJVPF7joTWsADe"], ["created_at", "2017-03-14 00:20:14.262752"], ["updated_at", "2017-03-14 00:20:14.262752"]]

    def edit
        @user = User.find_by(id: session[:user_id])
        if @user and @user.authenticate(params[:user][:password]) and !params[:user][:optional].empty?
            @user.optional = params[:user][:optional]
            @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "users" SET "optional" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["optional", nil], ["updated_at", "2017-03-14 02:57:16.993976"], ["id", 10]]