app/views/application/main.html.erb

<% if session[:user_name] %>
    <%= User.find_by(id: session[:user_id]).optional %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]